//
//  Korean.swift
//  MiniGame
//
//  Created by 신민희 on 2021/05/01.
//

import Foundation

class Korean {
    static let shared = Korean()
    
//    let hangle = ["ㄱㅂ", "ㄱㅈ", "ㄱㄷ", "ㄱㄱ", "ㄱㅅ", "ㄱㅁ", "ㄱㄴ", "ㄱㅇ", "ㄱㄹ", "ㄱㅎ", "ㄱㅋ", "ㄱㅌ", "ㄴㅂ", "ㄴㅈ", "ㄴㄷ", "ㄴㄱ", "ㄴㅅ", "ㄴㅁ", "ㄴㄴ", "ㄴㅇ", "ㄴㄹ", "ㄴㅎ", "ㄴㅋ", "ㄴㅌ","ㄷㅂ", "ㄷㅈ", "ㄷㄷ", "ㄷㄱ", "ㄷㅅ", "ㄷㅁ", "ㄷㄴ", "ㄷㅇ", "ㄷㄹ", "ㄷㅎ", "ㄷㅋ", "ㄷㅌ","ㄹㅂ", "ㄹㅈ", "ㄹㄷ", "ㄹㄱ", "ㄹㅅ", "ㄹㅁ", "ㄹㄴ", "ㄹㅇ", "ㄹㄹ", "ㄹㅎ", "ㄹㅋ", "ㄹㅌ","ㅁㅂ", "ㅁㅈ", "ㅁㄷ", "ㅁㄱ", "ㅁㅅ", "ㅁㅁ", "ㅁㄴ", "ㅁㅇ", "ㅁㄹ", "ㅁㅎ", "ㅁㅋ", "ㅁㅌ","ㅂㅂ", "ㅂㅈ", "ㅂㄷ", "ㅂㄱ", "ㅂㅅ", "ㅂㅁ", "ㅂㄴ", "ㅂㅇ", "ㅂㄹ", "ㅂㅎ", "ㅂㅋ", "ㅂㅌ","ㅅㅂ", "ㅅㅈ", "ㅅㄷ", "ㅅㄱ", "ㅅㅅ", "ㅅㅁ", "ㅅㄴ", "ㅅㅇ", "ㅅㄹ", "ㅅㅎ", "ㅅㅋ", "ㅅㅌ","ㅇㅂ", "ㅇㅈ", "ㅇㄷ", "ㅇㄱ", "ㅇㅅ", "ㅇㅁ", "ㅇㄴ", "ㅇㅇ", "ㅇㄹ", "ㅇㅎ", "ㅇㅋ", "ㅇㅌ","ㅈㅂ", "ㅈㅈ", "ㅈㄷ", "ㅈㄱ", "ㅈㅅ", "ㅈㅁ", "ㅈㄴ", "ㅈㅇ", "ㅈㄹ", "ㅈㅎ", "ㅈㅋ", "ㅈㅌ","ㅊㅂ", "ㅊㅈ", "ㅊㄷ", "ㅊㄱ", "ㅊㅅ", "ㅊㅁ", "ㅊㄴ", "ㅊㅇ", "ㅊㄹ", "ㅊㅎ", "ㅊㅋ", "ㅊㅌ","ㅋㅂ", "ㅋㅈ", "ㅋㄷ", "ㅋㄱ", "ㅋㅅ", "ㅋㅁ", "ㅋㄴ", "ㅋㅇ", "ㅋㄹ", "ㅋㅎ", "ㅋㅋ", "ㅋㅌ","ㅌㅂ", "ㅌㅈ", "ㅌㄷ", "ㅌㄱ", "ㅌㅅ", "ㅌㅁ", "ㅌㄴ", "ㅌㅇ", "ㅌㄹ", "ㅌㅎ", "ㅌㅋ", "ㅌㅌ","ㅍㅂ", "ㅍㅈ", "ㅍㄷ", "ㅍㄱ", "ㅍㅅ", "ㅍㅁ", "ㅍㄴ", "ㅍㅇ", "ㅍㄹ", "ㅍㅎ", "ㅍㅋ", "ㅍㅌ","ㅎㅂ", "ㅎㅈ", "ㅎㄷ", "ㅎㄱ", "ㅎㅅ", "ㅎㅁ", "ㅎㄴ", "ㅎㅇ", "ㅎㄹ", "ㅎㅎ", "ㅎㅋ", "ㅎㅌ", ]
    
    let first = ["ㄱ", "ㄴ", "ㄷ", "ㄹ", "ㅁ", "ㅂ", "ㅅ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"]
 
}
