//
//  Word.swift
//  MiniGame
//
//  Created by 신민희 on 2021/04/30.
//

import Foundation
class Word {
    static let shared = Word()
    
    let food = ["피자", "치킨", "족발", "보쌈", "돈가스", "삼겹살", "짜장면", "탕수육", "짬뽕"]
    let singer = ["다비치", "ITZY(있지)", "오반(OVAN)", "아이유", "브레이브걸스", "SG워너비", "에이핑스", "블랙핑크"]
    let brand = ["나이키", "아이다스", "폴로", "아크네", "리바이스", "ZARA", "H&M", "파타고니아", "미즈노", "세인트제임스"]
    let animal = ["강아지", "고양이", "기린", "나무늘보", "원숭이", "북극곰", "양"]
    let place = ["카페", "공원", "병원", "한강", "스터디카페", "옷가게", ""]
    let vehicle = ["자동차", "자전거", "비행기", "전동킥보드", "오토바이", "탱크", "말"]
    let job = ["항공기 승무원", "택시 기사", "타워 크레인 기사", "대기업 사원", "세무사", "회계사", "변호사", "의사", "개발자", ]
    let movie = [""]
    let actor = [""]
 
}
