//
//  File.swift
//  MiniGame
//
//  Created by 신민희 on 2021/05/04.
//

import Foundation

class MovieAlphabet {
    static let shared = MovieAlphabet()
    
    let qAndA = ["문제": ["ㅌㄱㄱㅎㄴㄹㅁ", "ㅁㄴㄹ", "ㅂㅈㄷㅅ", "ㄱㅎㅈㅇ", "ㄱㅅㅊ", "ㅇㅅㅌ", "ㅂㄷㅅ", "ㅂㅇㄷㅈㅌ", "ㅍㅅㅇㄴㅅㄱㅈㅇ", "ㅇㅇㅈ", "ㅅㄷ", "ㅇㅇㄴㅈ", "ㅁㄹ", "ㄱㅈㅅㅈ", "ㅂㅌㄹ", "ㅊㅂㅂㅇㅅㅁ", "ㅇㅅ"],
        "정답": ["태극기휘날리며", "미나리", "범죄도시", "극한직업", "기생충", "엑시트", "백두산", "봉오동전투", "82년생김지영", "악인전", "시동", "왕의남자", "명량", "국제시장", "베테랑", "도둑들", "7번방의선물", "암살"]]
    
    let dicQAndA = ["ㅌㄱㄱㅎㄴㄹㅁ": ["태극기휘날리며"],
                    "ㅁㄴㄹ": ["미나리"],
                    "ㅂㅈㄷㅅ": ["범죄도시"],
                    "ㄱㅎㅈㅇ": ["극한직업"],
                    "ㄱㅅㅊ": ["기생충"],
                    "ㅇㅅㅌ": ["엑시트"],
                    "ㅂㄷㅅ": ["백두산"],
                    "ㅂㅇㄷㅈㅌ": ["봉오동전투"],
                    "ㅍㅅㅇㄴㅅㄱㅈㅇ": ["82년생김지영"],
                    "ㅇㅇㅈ": ["악인전"],
                    "ㅅㄷ": ["시동"],
                    "ㅇㅇㄴㅈ": ["왕의남자"],
                    "ㅁㄹ": ["명량"],
                    "ㄱㅈㅅㅈ": ["국제시장"],
                    "ㅂㅌㄹ": ["베테랑"],
                    "ㅊㅂㅂㅇㅅㅁ": ["7번방의선물"],
                    "ㅇㅅ": ["암살"]]
    
    let lastQAndA = ["ㅌㄱㄱㅎㄴㄹㅁ": "태극기휘날리며", "ㅁㄴㄹ": "미나리", "ㅂㅈㄷㅅ": "범죄도시", "ㄱㅎㅈㅇ": "극한직업", "ㄱㅅㅊ": "기생충", "ㅇㅅㅌ": "엑시트", "ㅂㄷㅅ": "백두산", "ㅂㅇㄷㅈㅌ": "봉오동전투", "ㅍㅅㅇㄴㅅㄱㅈㅇ": "82년생김지영", "ㅇㅇㅈ": "악인전", "ㅅㄷ": "시동", "ㅇㅇㄴㅈ": "왕의남자", "ㅁㄹ": "명량", "ㄱㅈㅅㅈ": "국제시장", "ㅂㅌㄹ": "베테랑",
        "ㅊㅂㅂㅇㅅㅁ": "7번방의선물", "ㅇㅅ": "암살"]
    
 
}

