//
//  File.swift
//  MiniGame
//
//  Created by 신민희 on 2021/05/04.
//

import Foundation

class MovieAlphabet {
    static let shared = MovieAlphabet()
    
    let qAndA = ["문제": ["ㅌㄱㄱㅎㄴㄹㅁ", "ㅁㄴㄹ", "ㅂㅈㄷㅅ", "ㄱㅎㅈㅇ", "ㄱㅅㅊ", "ㅇㅅㅌ", "ㅂㄷㅅ", "ㅂㅇㄷㅈㅌ", "ㅍㅅㅇㄴㅅㄱㅈㅇ", "ㅇㅇㅈ", "ㅅㄷ", "ㅇㅇㄴㅈ", "ㅁㄹ", "ㄱㅈㅅㅈ", "ㅂㅌㄹ", "ㄷㄷㄷ", "ㅊㅂㅂㅇㅅㅁ", "ㅇㅅ", "ㅅㅂ", "ㄴㅇㅇㄱㅇ", "ㅇㄱㅍㅊ", "ㅊㅈㅎㄱㅈㅆ", "ㄱㅈㅂㅌㅇㅇㅇ", "ㅍㄹㅈ", "ㄱㅎ,ㅇㅇㄷㄴㅈ", "ㅎㅁㄴ", "ㅅㄹㅎ", "ㅎㅇㄷ", "ㄱㄱㄷㅍ", "ㅇㅂㅎㅌㅇ", "ㅂㄷ", "ㅅㅇㅇㅊㅇ", "ㅇㄷㅂㅇ", "ㄱㅅ", "ㅇㄱㅈㅇㄱㄴ", "ㄸㅍㄹ", "ㅊㄱㅈ", "ㅇㄱㅆ", "ㅎㄹㅇㄱㅅㅌ", "ㅅㄱㅎㄲ", "ㅆㄴ", "ㄴㄷㅇㅇㅎ", "ㅂㅌㅇㅅㅇㄷ", "ㄱㅅㅈㄷ"],
        "정답": ["태극기휘날리며", "미나리", "범죄도시", "극한직업", "기생충", "엑시트", "백두산", "봉오동전투", "82년생김지영", "악인전", "시동", "왕의남자", "명량", "국제시장", "베테랑", "도둑들", "7번방의선물", "암살", "서복", "내일의기억", "1987(일구팔칠)", "친절한금자씨", "가장보통의연애", "프리즌", "광해,왕이된남자", "하모니", "승리호", "해운대", "국가대표", "완벽한타인", "반도", "살인의추억", "올드보이", "곡성", "엽기적인그녀", "똥파리", "추격자", "아가씨", "헬로우고스트", "신과함께", "써니", "늑대의유혹", "뷰티인사이드", "감시자들"]]
    
    let dicQAndA = ["ㅌㄱㄱㅎㄴㄹㅁ": "태극기휘날리며",
                    "ㅁㄴㄹ": "미나리",
                    "ㅂㅈㄷㅅ": "범죄도시",
                    "ㄱㅎㅈㅇ": "극한직업",
                    "ㄱㅅㅊ": "기생충",
                    "ㅇㅅㅌ": "엑시트",
                    "ㅂㄷㅅ": "백두산",
                    "ㅂㅇㄷㅈㅌ": "봉오동전투",
                    "ㅍㅅㅇㄴㅅㄱㅈㅇ": "82년생김지영",
                    "ㅇㅇㅈ": "악인전",
                    "ㅅㄷ": "시동",
                    "ㅇㅇㄴㅈ": "왕의남자",
                    "ㅁㄹ": "명량",
                    "ㄱㅈㅅㅈ": "국제시장",
                    "ㅂㅌㄹ": "베테랑",
                    "ㄷㄷㄷ": "도둑들",
                    "ㅊㅂㅂㅇㅅㅁ": "7번방의선물",
                    "ㅇㅅ": "암살",
                    "ㅅㅂ": "서복",
                    "ㄴㅇㅇㄱㅇ": "내일의기억",
                    "ㅇㄱㅍㅊ": "1987(일구팔칠)",
                    "ㅊㅈㅎㄱㅈㅆ": "친절한금자씨",
                    "ㄱㅈㅂㅌㅇㅇㅇ": "가장보통의연애",
                    "ㅍㄹㅈ": "프리즌",
                    "ㄱㅎ,ㅇㅇㄷㄴㅈ": "광해,왕이된남자",
                    "ㅎㅁㄴ": "하모니",
                    "ㅅㄹㅎ": "승리호",
                    "ㅎㅇㄷ": "해운대",
                    "ㄱㄱㄷㅍ": "국가대표",
                    "ㅇㅂㅎㅌㅇ": "완벽한타인",
                    "ㅂㄷ": "반도",
                    "ㅅㅇㅇㅊㅇ": "살인의추억",
                    "ㅇㄷㅂㅇ": "올드보이",
                    "ㄱㅅ": "곡성",
                    "ㅇㄱㅈㅇㄱㄴ": "엽기적인그녀",
                    "ㄸㅍㄹ": "똥파리",
                    "ㅊㄱㅈ": "추격자",
                    "ㅇㄱㅆ": "아가씨",
                    "ㅎㄹㅇㄱㅅㅌ": "헬로우고스트",
                    "ㅅㄱㅎㄲ": "신과함께",
                    "ㅆㄴ": "써니",
                    "ㄴㄷㅇㅇㅎ": "늑대의유혹",
                    "ㅂㅌㅇㅅㅇㄷ": "뷰티인사이드",
                    "ㄱㅅㅈㄷ": "감시자들"]
    
}
