//
//  Word.swift
//  MiniGame
//
//  Created by 신민희 on 2021/04/30.
//

import Foundation
class Word {
    static let shared = Word()
    
    let topicManager = ["음식": ["피자", "치킨", "족발", "보쌈", "돈가스", "삼겹살", "짜장면", "탕수육", "짬뽕", "로제떡볶이", "뿌링클", "고추바사삭", "고추마요치킨", "불족발", "김치피자탕수육", "팔보채", "깐풍기", "고추잡채", "꽃빵", "크리스피도넛", "비요뜨", "불스떡볶이", "엽기떡볶이", "신전떡볶이", "죠스떡볶이", "포카칩", "스윙칩", "칸쵸", "씨리얼", "프링글스", "오감자", "칙촉", "촉촉한 초코칩", "포카리스웨트", "게토레이", "코카콜라", "펩시", "칠성사이다", "천연사이다", "배추김치", "파김치", "총각김치", "갓김치", "오이소박이", "물김치", "백김치"],
                        "가수" : ["다비치", "ITZY(있지)", "오반(OVAN)", "아이유", "브레이브걸스", "SG워너비", "에이핑크", "블랙핑크", "2AM", "2PM", "오마이걸", "걸스데이", "먼데이 키즈", "허각", "나윤권", "백지영", "빅마마", "라붐", "성시경", "모모랜드", "장덕철", "거미", "휘성", "치즈", "캔", "폴킴", "정준일", "이예준", "신예영", "벤", "SG워너비", "수지", "방탄소년단", "브레이브걸스"],
                        "브랜드": ["나이키", "아이다스", "폴로", "아크네", "리바이스", "ZARA", "H&M", "파타고니아", "미즈노", "세인트제임스", "JAJU", "에잇세컨즈", "챔피온", "시슬리", "루이비통", "샤넬", "살바토레페라가모", "미우미우", "메종마르지엘라", "구찌", "미샤", "더페이스샵", "맥(MAC)", "바비브라운", "올리브영", "롭스", "에뛰드", "토니모리", "티파니앤코", "불가리", "까르띠에", "에르메스", "코치", "러브캣", "마크제이콥스", "디올", "로에베"],
                        "동물": ["강아지", "고양이", "기린", "나무늘보", "원숭이", "북극곰", "양", "호랑이", "사자", "말", "참새", "비둘기", "기러기", "앵무새", "햄스터", "기니피그", "돼지", "흑돼지", "비숑", "말티즈", "리트리버", "닭", "병아리", "꿩", "오골계", "소", "토끼", "까마귀", "까치", "낙타", "플라밍고", "공작새", "뱀", "도마뱀"],
                        "장소": ["카페", "공원", "서울대병원", "한강", "스터디카페", "옷가게", "서울역", "영등포역", "인천역", "수원역", "현대백화점", "신세계백화점", "롯데백화점", "롯데아울렛", "신세계아울렛", "현대프리미엄아울렛", "중앙대병원", "동국대병원", "연세대병원", "단국대학교", "동국대학교", "서강대학교", "서울대학교", "중앙대학교", "건국대학교", "건국대병원", "인하대학교", "인하대병원", "연세대학교", "고려대학교", "63빌딩", "동대문", "서대문", "남대문", "남대문시장", "남산"],
                        "탈것": ["자동차", "자전거", "비행기", "전동킥보드", "오토바이", "탱크", "말", "킥보드", "트럭", "SUV차량", "세발자전거", "네발자전거", "롤러스케이트", "롤러브레이드", "힐리스", "가마", "RV차량", "사륜오토바이", "따릉이", ""],
                        "직업": ["항공기 승무원", "택시 기사", "타워 크레인 기사", "대기업 사원", "세무사", "회계사", "변호사", "의사", "개발자", "엔지니어", "병원코디네이터", "결혼상담원", "산업용로봇조작원", "포장원", "의복제품검사원", "단열원", "음악치료사", "호스피스간호사", "운동처방사", "여행설계사", "베타테스터", "게임시나리오작가", "보안프로그램개발원"],
                        "국내영화" : ["미나리", "태극기휘날리며", "미나리", "범죄도시", "극한직업", "기생충", "엑시트", "백두산", "봉오동전투", "82년생김지영", "악인전", "시동", "왕의남자", "명량", "국제시장", "베테랑", "도둑들", "7번방의선물", "암살", "서복", "내일의기억", "1987(일구팔칠)", "친절한금자씨", "가장보통의연애", "프리즌", "광해,왕이된남자", "하모니", "승리호", "해운대", "국가대표", "완벽한타인", "반도", "살인의추억", "올드보이", "곡성", "엽기적인그녀", "똥파리", "추격자", "아가씨", "헬로우고스트", "신과함께", "써니", "늑대의유혹", "뷰티인사이드", "감시자들"],
                        "배우": ["현빈", "이도현", "고민시", "오만석", "손예진", "이민호", "김범", "김수현", "김태리", "이병현", "혜리", "류승범", "류승룡", "류준열", "박보검", "공유", "유연석", "이재훈", "하지원", "한효주", "강동원", "고소영", "한예슬", "한채영", "한가인", "김선아", "윤은혜", "수지", "문채원", "이승기", "송혜교", "송중기", "진구", "김지원", "황정음", "최다니엘", "박하선", "신세경", "정보석", "이순재", "선우용녀", "오지명", "한소희", "김희애", "김소연", "유진", "한지현", "이연희", "이선균", "신민아", "소지섭", "이정재", "정우성", "황정민", "마동석", "윤계상", "이하늬", "정려원", "남주혁", "이성경", "김현주", "구혜선", "김민정", "신현준", "권상우", "김하늘", "김수로", "정유미", "문정혁", "김슬기"]]
    
}
